### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.io_platform_apim_api_itn.azurerm_api_management_api.identity will be created
  + resource "azurerm_api_management_api" "identity" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + api_type              = (known after apply)
      + description           = "IO Auth-n-Identity AppBackend API"
      + display_name          = "Auth-n-Identity AppBackend"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-identity-api"
      + path                  = "api/identity"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + subscription_required = false
      + version               = "v1"
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/pagopa/io-backend/ae846fb22834f931555b3c27a4592cba41380f38/openapi/generated/api_identity.yaml"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.io_platform_apim_api_itn.azurerm_api_management_api_policy.identity will be created
  + resource "azurerm_api_management_api_policy" "identity" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-identity-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <set-backend-service id="apim-pool-app-backend"
                        backend-id="pool-app-backend" />
                    <rewrite-uri template='@(context.Request.Url.Path)' />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.io_platform_apim_api_itn.azurerm_api_management_api_tag.app_backend_api_tag will be created
  + resource "azurerm_api_management_api_tag" "app_backend_api_tag" {
      + api_id = (known after apply)
      + id     = (known after apply)
      + name   = "Auth-n-Identity"
    }

  # module.io_platform_apim_api_itn.azurerm_api_management_api_version_set.identity_v1 will be created
  + resource "azurerm_api_management_api_version_set" "identity_v1" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + display_name        = "Auth-n-Identity AppBackend v1"
      + id                  = (known after apply)
      + name                = "identity_v1"
      + resource_group_name = "io-p-itn-common-rg-01"
      + versioning_scheme   = "Segment"
    }

  # module.io_platform_apim_api_itn.azurerm_api_management_product_api.auth_identity will be created
  + resource "azurerm_api_management_product_api" "auth_identity" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-identity-api"
      + id                  = (known after apply)
      + product_id          = "io-auth"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.io_platform_apim_api_itn.azurerm_api_management_tag.app_backend_tag will be created
  + resource "azurerm_api_management_tag" "app_backend_tag" {
      + api_management_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
      + display_name      = (known after apply)
      + id                = (known after apply)
      + name              = "Auth-n-Identity"
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>
